In [140]:
import pandas as pd 
import numpy as np
pd.__version__,np.__version__

('0.25.1', '1.18.1')

In [8]:
a=pd.Series(["risu","nisu","runchu","punchu"],index=['a','b','c','d'])
a

a      risu
b      nisu
c    runchu
d    punchu
dtype: object

In [11]:
print(a[0])
a['a']

risu

'risu'

In [28]:
a=pd.DataFrame(data=[[1,2,3,4],[6,7,8,9]],columns=["a","b",'c','d'],
                  index=['i','ii'])
a

    a  b  c  d
i   1  2  3  4
ii  6  7  8  9

In [29]:
print(a.loc['i'])
a.iloc[0]

a    1
b    2
c    3
d    4
Name: i, dtype: int64

a    1
b    2
c    3
d    4
Name: i, dtype: int64

In [68]:
population_dict=[['Kathmandu',13442342],
                 ['Biratnagar',1231231],
                 ['Itahari',2313122],
                 ['Dharan',213123],
                 ['Bhaktapur',1231211]]
colu=["Cities","Population"]
# print(population_dict)
df=pd.DataFrame(data=population_dict,columns=colu)
df

       Cities  Population
0   Kathmandu    13442342
1  Biratnagar     1231231
2     Itahari     2313122
3      Dharan      213123
4   Bhaktapur     1231211

In [109]:
population_dict={'Kathmandu':13442342,
                 'Biratnagar':1231231,
                 'Itahari':2313122,
                 'Dharan':213123,
                 'Bhaktapur':1231211}
p_d=pd.Series(population_dict)

print(p_d['Itahari'])
p_d['Kathmandu':'Dharan']

2313122

Kathmandu     13442342
Biratnagar     1231231
Itahari        2313122
Dharan          213123
dtype: int64

In [87]:
p_d.keys()

Index(['Kathmandu', 'Biratnagar', 'Itahari', 'Dharan', 'Bhaktapur'], dtype='object')

In [88]:
p_d.values

array([13442342,  1231231,  2313122,   213123,  1231211], dtype=int64)

In [91]:
p_d.value_counts()

1231231     1
13442342    1
213123      1
2313122     1
1231211     1
dtype: int64

In [93]:
pd.Series(1,index=[1,2,3,4,5])

1    1
2    1
3    1
4    1
5    1
dtype: int64

In [106]:
# sorting indexes and its values
print(pd.Series({2:'a',5:'b',1:'c',3:'d',4:'e'}).sort_index())
print(pd.Series({2:'a',5:'b',1:'c',3:'d',4:'e'}).sort_values())

1    c
2    a
3    d
4    e
5    b
dtype: object
2    a
5    b
1    c
3    d
4    e
dtype: object

In [123]:

area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
'Florida': 170312, 'Illinois': 149995}
df=pd.DataFrame({'Population':p_d,
                 'area':area_dict})
# df['Population'].isnull()
# df['Population'].notnull()
df['Population']=df['Population'].fillna(df['Population'].mean())
df['area']=df['area'].fillna(df['area'].mean())
df

            Population      area
Bhaktapur    1231211.0  316246.6
Biratnagar   1231231.0  316246.6
California   3686205.8  423967.0
Dharan        213123.0  316246.6
Florida      3686205.8  170312.0
Illinois     3686205.8  149995.0
Itahari      2313122.0  316246.6
Kathmandu   13442342.0  316246.6
New York     3686205.8  141297.0
Texas        3686205.8  695662.0

In [134]:
print("keys:\n",df.keys(),"\n")
print("indexes:\n",df.index,"\n")
print("Column names:\n",df.columns)

keys:
 Index(['Population', 'area'], dtype='object')

indexes:
 Index(['Bhaktapur', 'Biratnagar', 'California', 'Dharan', 'Florida',
       'Illinois', 'Itahari', 'Kathmandu', 'New York', 'Texas'],
      dtype='object')

Column names:
 Index(['Population', 'area'], dtype='object')

In [137]:
df['area'],df['Population']

(Bhaktapur     316246.6
 Biratnagar    316246.6
 California    423967.0
 Dharan        316246.6
 Florida       170312.0
 Illinois      149995.0
 Itahari       316246.6
 Kathmandu     316246.6
 New York      141297.0
 Texas         695662.0
 Name: area, dtype: float64, Bhaktapur      1231211.0
 Biratnagar     1231231.0
 California     3686205.8
 Dharan          213123.0
 Florida        3686205.8
 Illinois       3686205.8
 Itahari        2313122.0
 Kathmandu     13442342.0
 New York       3686205.8
 Texas          3686205.8
 Name: Population, dtype: float64)

In [156]:
data=[{'a':i,
       'b':2*i+1} for i in range(10)]
print(len(data))
pd.DataFrame(data,index=[chr(i) for i in range(97,97+len(data))])

10

   a   b
a  0   1
b  1   3
c  2   5
d  3   7
e  4   9
f  5  11
g  6  13
h  7  15
i  8  17
j  9  19